## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [18]:
import pandas as pd

In [31]:
sr1 = pd.Series([4,8,15,16,23,42])

In [32]:
type(sr1)

pandas.core.series.Series

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [41]:
list1 = [ i for i in range (11,21)]

In [42]:
list1

[11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [36]:
import pandas

In [44]:
sr2 = pandas.Series(list1)

In [45]:
print(sr2)

0    11
1    12
2    13
3    14
4    15
5    16
6    17
7    18
8    19
9    20
dtype: int64

## Q3. Create a Pandas DataFrame that contains the following data:
Name    Age    Gender

Alice   25     Female

Bob     30     Male

Claire  27     Female

In [48]:
dict1 ={"Name" : ["Alice","Bob","Claire"],"Age" : ["25" , "30", "27"],"Gender" : ["Female","Male","Female"]}

In [49]:
dict1

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': ['25', '30', '27'],
 'Gender': ['Female', 'Male', 'Female']}

In [3]:
import pandas as pd

In [53]:
df1 = pd.DataFrame(dict1)

In [54]:
df1

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [55]:
type(df1)

pandas.core.frame.DataFrame

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
In pandas we have 3 type of DATA structres They are
	a)Series===can contain ndarray==>ndarray contain list.
	b)Data Frame
	c)Panel
    
Data frame is one of the two dimentional labeled data structureto organize the data
in the form of rows and columns
In otherwards ,Data frames stores the data in the form of rows and columns

Features of Data frames
-------------------------------
1)The column names of DataFrame can be different or same data type(int,float,str etc)
2)The size of data frame is muttable.
3)Data frames contains two axes(Row and column)

How Series and Dataframe differ :
    
1)DataFrame is container of Series.
2)we kmow that Series is one dimensional labelled array capable of holding homogeneous
    data of any type(Integer,String,Float,python object)
3)DataFrame, we have multiple columns and multiple rows.
3)To create a series ,we use a predefined function Series()
4)To crete a dataframe ,we use we use Dataframe()

Note: 
    
Series in pandas contains a single list which can store heterogeneous type of data, 
because of this, series is also considered as a 1-dimensional data structure.

DataFrame is a 2-dimensional data structure which contains multiple lists of heterogeneous type of data.
DataFrame can contain multiple series or it can be considered as a collection of series.

In [57]:
#e.g consider below dictonary.

dict1 ={"Girl" : ["Radha" ,"Sita"] ,"Boys" : ["Krishna","Ram"]}

In [58]:
dict1

{'Girl': ['Radha', 'Sita'], 'Boys': ['Krishna', 'Ram']}

In [67]:
sr4 = pd.Series(dict1)

In [68]:
sr4

Girl     [Radha, Sita]
Boys    [Krishna, Ram]
dtype: object

In [72]:
sr4["Girl"]

['Radha', 'Sita']

In [61]:
type(sr4)

pandas.core.series.Series

In [63]:
df3 = pd.DataFrame(dict1)

In [66]:
df3

    Girl     Boys
0  Radha  Krishna
1   Sita      Ram

In [71]:
df3["Girl"]

0    Radha
1     Sita
Name: Girl, dtype: object

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [4]:
df1 =pd.read_csv("services.csv")

In [27]:
df1.head()##gives u by default first 5 entries file.you can enter the number of entries u want to see

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN
3,4,4,NaN,NaN,NaN,Apply by phone.,"Parents, children, families with problems of c...",Provides supervised visitation services and a ...,None,NaN,...,NaN,"INDIVIDUAL AND FAMILY DEVELOPMENT SERVICES, Gr...",NaN,Family Visitation Center,NaN,San Mateo County,active,No wait.,NaN,NaN
4,5,5,NaN,NaN,NaN,Phone for information.,Low-income working families with children tran...,Provides fixed 8% short term loans to eligible...,Eligibility: Low-income family with legal cust...,NaN,...,NaN,"COMMUNITY SERVICES, Speakers, Automobile Loans",NaN,Economic Self-Sufficiency Program,NaN,San Mateo County,active,NaN,NaN,NaN

In [28]:
df1.tail()#we can see lst 5 entries by defauly

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
18,19,19,NaN,NaN,NaN,Call for screening appointment (650-347-3648).,NaN,Provides free medical and dental care to those...,Low-income person without access to health care,NaN,...,NaN,"HEALTH SERVICES, Outpatient Care, Community Cl...",NaN,San Mateo Free Medical Clinic,NaN,"Belmont, Burlingame",active,Varies.,NaN,NaN
19,20,20,NaN,NaN,NaN,Walk in.,NaN,no unrequired fields for this service,NaN,NaN,...,NaN,NaN,NaN,Service with blank fields,NaN,NaN,defunct,NaN,NaN,NaN
20,21,21,NaN,NaN,NaN,By phone during business hours.,NaN,just a test service,NaN,NaN,...,NaN,NaN,NaN,Service for Admin Test Location,NaN,San Mateo County,inactive,NaN,NaN,NaN
21,22,22,NaN,"Cash, Check, Credit Card",Fotos para pasaportes,Walk in or apply by phone or mail,"Profit and nonprofit businesses, the public, m...",[NOTE THIS IS NOT A REAL SERVICE--THIS IS FOR ...,None,passports@example.org,...,We offer 3-way interpretation services over th...,"Salud, Medicina",Spanish,Passport Photos,Government-issued picture identification,"Alameda County, San Mateo County",active,No wait to 2 weeks.,http://www.example.com,"105, 108, 108-05, 108-05-01, 111, 111-05"
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [95]:
type(df1)#type of structure

pandas.core.frame.DataFrame

In [96]:
df1.columns

Index(['id', 'location_id', 'program_id', 'accepted_payments',
       'alternate_name', 'application_process', 'audience', 'description',
       'eligibility', 'email', 'fees', 'funding_sources',
       'interpretation_services', 'keywords', 'languages', 'name',
       'required_documents', 'service_areas', 'status', 'wait_time', 'website',
       'taxonomy_ids'],
      dtype='object')

In [29]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 22 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   id                       23 non-null     int64
 1   location_id              23 non-null     int64
 2   program_id               0 non-null      float64
 3   accepted_payments        1 non-null      object
 4   alternate_name           1 non-null      object
 5   application_process      23 non-null     object
 6   audience                 14 non-null     object
 7   description              23 non-null     object
 8   eligibility              21 non-null     object
 9   email                    1 non-null      object
 10  fees                     21 non-null     object
 11  funding_sources          21 non-null     object
 12  interpretation_services  1 non-null      object
 13  keywords                 21 non-null     object
 14  languages                1 non-null      object
 15  name                     23 non-null     object
 16  required_documents       1 non-null      object
 17  service_areas            21 non-null     object
 18  status                   23 non-null     object
 19  wait_time                19 non-null     object
 20  website                  2 non-null      object
 21  taxonomy_ids             1 non-null      object
dtypes: float64(1), int64(2), object(19)
memory usage: 4.1+ KB

In [30]:
#total no of missing values in each column
df1.isnull().sum()

id                          0
location_id                 0
program_id                 23
accepted_payments          22
alternate_name             22
application_process         0
audience                    9
description                 0
eligibility                 2
email                      22
fees                        2
funding_sources             2
interpretation_services    22
keywords                    2
languages                  22
name                        0
required_documents         22
service_areas               2
status                      0
wait_time                   4
website                    21
taxonomy_ids               22
dtype: int64

In [33]:
#descriptive statastical value of columns
print(df1.describe())

             id  location_id  program_id
count  23.00000    23.000000         0.0
mean   12.00000    11.956522         NaN
std     6.78233     6.711444         NaN
min     1.00000     1.000000         NaN
25%     6.50000     6.500000         NaN
50%    12.00000    12.000000         NaN
75%    17.50000    17.500000         NaN
max    23.00000    22.000000         NaN

In [34]:
print(df1.describe(include='all'))

              id  location_id  program_id         accepted_payments  \
count   23.00000    23.000000         0.0                         1
unique       NaN          NaN         NaN                         1
top          NaN          NaN         NaN  Cash, Check, Credit Card
freq         NaN          NaN         NaN                         1
mean    12.00000    11.956522         NaN                       NaN
std      6.78233     6.711444         NaN                       NaN
min      1.00000     1.000000         NaN                       NaN
25%      6.50000     6.500000         NaN                       NaN
50%     12.00000    12.000000         NaN                       NaN
75%     17.50000    17.500000         NaN                       NaN
max     23.00000    22.000000         NaN                       NaN

               alternate_name                application_process  \
count                       1                                 23
unique                      1                                 20
top     Fotos para pasaportes  Walk in or apply by phone or mail
freq                        1                                  2
mean                      NaN                                NaN
std                       NaN                                NaN
min                       NaN                                NaN
25%                       NaN                                NaN
50%                       NaN                                NaN
75%                       NaN                                NaN
max                       NaN                                NaN

                                                 audience  \
count                                                  14
unique                                                 14
top     Older adults age 55 or over, ethnic minorities...
freq                                                    1
mean                                                  NaN
std                                                   NaN
min                                                   NaN
25%                                                   NaN
50%                                                   NaN
75%                                                   NaN
max                                                   NaN

                                              description eligibility  \
count                                                  23          21
unique                                                 23          16
top     A walk-in center for older adults that provide...        None
freq                                                    1           4
mean                                                  NaN         NaN
std                                                   NaN         NaN
min                                                   NaN         NaN
25%                                                   NaN         NaN
50%                                                   NaN         NaN
75%                                                   NaN         NaN
max                                                   NaN         NaN

                        email  ...  \
count                       1  ...
unique                      1  ...
top     passports@example.org  ...
freq                        1  ...
mean                      NaN  ...
std                       NaN  ...
min                       NaN  ...
25%                       NaN  ...
50%                       NaN  ...
75%                       NaN  ...
max                       NaN  ...

                                  interpretation_services  \
count                                                   1
unique                                                  1
top     We offer 3-way interpretation services over th...
freq                                                    1
mean                                                  NaN
std                                                   NaN
min                                                   NaN
25%                                                   NaN
50%                                                   NaN
75%                                                   NaN
max                                                   NaN

                                                 keywords languages  \
count                                                  21         1
unique                                                 18         1
top     EDUCATION SERVICES, Library, Libraries, Public...   Spanish
freq                                                    4         1
mean                                                  NaN       NaN
std                                                   NaN       NaN
min                                                   NaN       NaN
25%                                                   NaN       NaN
50%                                                   NaN       NaN
75%                                                   NaN       NaN
max                                                   NaN       NaN

                                   name  \
count                                23
unique                               23
top     Fair Oaks Adult Activity Center
freq                                  1
mean                                NaN
std                                 NaN
min                                 NaN
25%                                 NaN
50%                                 NaN
75%                                 NaN
max                                 NaN

                              required_documents     service_areas  status  \
count                                          1                21      23
unique                                         1                10       3
top     Government-issued picture identification  San Mateo County  active
freq                                           1                10      21
mean                                         NaN               NaN     NaN
std                                          NaN               NaN     NaN
min                                          NaN               NaN     NaN
25%                                          NaN               NaN     NaN
50%                                          NaN               NaN     NaN
75%                                          NaN               NaN     NaN
max                                          NaN               NaN     NaN

       wait_time                 website  \
count         19                       2
unique         7                       1
top     No wait.  http://www.example.com
freq          10                       2
mean         NaN                     NaN
std          NaN                     NaN
min          NaN                     NaN
25%          NaN                     NaN
50%          NaN                     NaN
75%          NaN                     NaN
max          NaN                     NaN

                                    taxonomy_ids
count                                          1
unique                                         1
top     105, 108, 108-05, 108-05-01, 111, 111-05
freq                                           1
mean                                         NaN
std                                          NaN
min                                          NaN
25%                                          NaN
50%                                          NaN
75%                                          NaN
max                                          NaN

[11 rows x 22 columns]

In [38]:
#Dropping the column

df1.drop('eligibility',axis=1,inplace=True)

In [5]:
len(df1)

23

In [9]:
max(df1['location_id'])

22

In [13]:
df1.iloc[0:3,[1,2]]

   location_id  program_id
0            1         NaN
1            2         NaN
2            3         NaN

In [14]:
df1.loc[0:3,['email','location_id']]

  email  location_id
0   NaN            1
1   NaN            2
2   NaN            3
3   NaN            4

### Append

In [3]:
df3=pd.DataFrame([[12,2,33,45],[12,34,56]],columns=['Pen','Shirt','Box','Mouse'])

In [5]:
df4=pd.DataFrame([[22,2,33,56],[12,3,65,89]],columns=['Pens','Shirt','Box','Mouse'])

In [6]:
df5=df3.append(df4)

/tmp/ipykernel_84/3607133396.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df5=df3.append(df4)

In [8]:
df5

    Pen  Shirt  Box  Mouse  Pens
0  12.0      2   33   45.0   NaN
1  12.0     34   56    NaN   NaN
0   NaN      2   33   56.0  22.0
1   NaN      3   65   89.0  12.0

### Merging the dataframes

In [23]:
india_wheather =pd.DataFrame({"city" : ['Mumbai','Pune','Delhi'],"temp":[35,34,23],"Humidity":[45,56,34]})
us_wheather =pd.DataFrame({"city" : ['Newyork','Chicago','orlando'],"temp":[23,22,56],"Humidity":[23,45,66]})
india_wheather1 =pd.DataFrame({"city" : ['Pune','Solapur','Delhi'],"temp":[30,38,40],"Humidity":[23,46,55]})

In [11]:
india_wheather

     city  temp  Humidity
0  Mumbai    35        45
1    Pune    34        56
2   Delhi    23        34

In [12]:
us_wheather

      city  temp  Humidity
0  Newyork    23        23
1  Chicago    22        45
2  orlando    56        66

In [16]:
df5 = pd.merge(india_wheather,us_wheather,on='city',how='outer')

In [19]:
df5

      city  temp_x  Humidity_x  temp_y  Humidity_y
0   Mumbai    35.0        45.0     NaN         NaN
1     Pune    34.0        56.0     NaN         NaN
2    Delhi    23.0        34.0     NaN         NaN
3  Newyork     NaN         NaN    23.0        23.0
4  Chicago     NaN         NaN    22.0        45.0
5  orlando     NaN         NaN    56.0        66.0

In [24]:
df6 = pd.merge(india_wheather,india_wheather1,on='city')

In [25]:
df6

    city  temp_x  Humidity_x  temp_y  Humidity_y
0   Pune      34          56      30          23
1  Delhi      23          34      40          55

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series – 1D labeled homogeneous array, sizeimmutable

features :
    Homogeneous data
    Size Immutable –size cannot be changed
    Values of Data Mutable
    
    
Data Frames – 2D labeled, size-mutable tabular structure with heterogenic columns
    
features :
    Heterogeneous data
    Size Mutable
    Data Mutable
    
Panel – 3D labeled size mutable array.
    
features:
    Heterogeneous data
    Size Mutable
    Data Mutable

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [75]:
s=pd.Series([10,20,30,40,50,60],index=['a','b','c','d','e','f'])

In [83]:
s1 =pd.Series([70,75,36,80,50,90],index=['a','b','c','d','e','f'])
s2 =pd.Series([75,75,35,50,57,88],index=['a','b','c','d','e','f'])

In [88]:
print ("s:", type(s1) ,"s1:",type(s1),"s2:",type(s2))

s: <class 'pandas.core.series.Series'> s1: <class 'pandas.core.series.Series'> s2: <class 'pandas.core.series.Series'>

In [85]:
df1 =pd.concat([s,s1,s2],axis=1)

In [86]:
df1

    0   1   2
a  10  70  75
b  20  75  75
c  30  36  35
d  40  80  50
e  50  50  57
f  60  90  88